mermaid code 적용, 리펙토링
